# Curso de Manipulaci√≥n y An√°lisis de Datos con Pandas y Python

## üìö M√≥dulo 2. Funcionalidades b√°sicas y esenciales de pandas

### Clase 9. Tipos de Variables que componen un DataFrame

Actualizar Pandas

In [ ]:
!pip install --upgrade pandas

Conectar a Google Drive

In [ ]:
from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

Posicionarse en la carpeta con el Data Set

In [ ]:
%cd '/content/drive/MyDrive/Colab Notebooks/Curso-Pandas-y-Python/db'
!ls

/content/drive/MyDrive/Colab Notebooks/Curso-Pandas-y-Python/db
Meteorite_Landings.csv	test.hdf   test.parquet  test.xlsx
test.csv		test.json  test.pkl

Importar Pandas

In [ ]:
import pandas as pd
pd.__version__

'1.1.5'

## An√°lisis

`head()` y `tail()` son m√©todos que permiten ver las filas en un DataFrame que est√°n al principio y al final respectivamente. POr defecto muestran 5 filas, pero eso se puede modificar pasandole al m√©todo el n√∫mero de filas que se quieren mostrar como par√°metro.

`sample()` extrae una muestra del Data Set con filas elegidas de forma aleatoria. El n√∫mero de filas que se quiere obtener se puede especificar como un par√°metro.

In [ ]:
df_meteorites = pd.read_csv('Meteorite_Landings.csv')
df_meteorites.head()

       name   id nametype  ...    reclat    reclong           GeoLocation
0    Aachen    1    Valid  ...  50.77500    6.08333     (50.775, 6.08333)
1    Aarhus    2    Valid  ...  56.18333   10.23333  (56.18333, 10.23333)
2      Abee    6    Valid  ...  54.21667 -113.00000    (54.21667, -113.0)
3  Acapulco   10    Valid  ...  16.88333  -99.90000     (16.88333, -99.9)
4   Achiras  370    Valid  ... -33.16667  -64.95000   (-33.16667, -64.95)

[5 rows x 10 columns]

`shape` muestra el n√∫mero de filas y columnas que tiene el DataFrame

In [ ]:
df_meteorites.shape

(45716, 10)

`size` muestra la cantidad total de registros quen componen el DataFrame

In [ ]:
df_meteorites.size

457160

`describe()` muestra cualidades estad√≠sticas de las variables num√©ricas de la base de datos

In [ ]:
# Quitar la notaci√≥n cient√≠fica
pd.options.display.float_format = '{:,.1f}'.format

df_meteorites.describe()

            id     mass (g)   reclat  reclong
count 45,716.0     45,585.0 38,401.0 38,401.0
mean  26,889.7     13,278.1    -39.1     61.1
std   16,860.7    574,988.9     46.4     80.6
min        1.0          0.0    -87.4   -165.4
25%   12,688.8          7.2    -76.7      0.0
50%   24,261.5         32.6    -71.5     35.7
75%   40,656.8        202.6      0.0    157.2
max   57,458.0 60,000,000.0     81.2    354.5

El par√°metro `include='all'` indica que no s√≥lo se analicen las variables num√©ricas sino tambi√©n las que son de tipo texto.

In [ ]:
df_meteorites.describe(include='all')

                         name       id nametype  ...   reclat  reclong GeoLocation
count                   45716 45,716.0    45716  ... 38,401.0 38,401.0       38401
unique                  45716      nan        2  ...      nan      nan       17100
top     Graves Nunataks 98157      nan    Valid  ...      nan      nan  (0.0, 0.0)
freq                        1      nan    45641  ...      nan      nan        6214
mean                      NaN 26,889.7      NaN  ...    -39.1     61.1         NaN
std                       NaN 16,860.7      NaN  ...     46.4     80.6         NaN
min                       NaN      1.0      NaN  ...    -87.4   -165.4         NaN
25%                       NaN 12,688.8      NaN  ...    -76.7      0.0         NaN
50%                       NaN 24,261.5      NaN  ...    -71.5     35.7         NaN
75%                       NaN 40,656.8      NaN  ...      0.0    157.2         NaN
max                       NaN 57,458.0      NaN  ...     81.2    354.5         NaN

[11 rows x 10 columns]

`info()` muestra como est√°n compuestas las categorias dentro del DataFrame. Por ejemplo muestra el tipo de dato de cada categor√≠a y cuantas variables no nulas hay

In [ ]:
df_meteorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

`dtypes` muestra el tipo de dato de cada columna del DataFrame

In [ ]:
df_meteorites.dtypes

name            object
id               int64
nametype        object
recclass        object
mass (g)       float64
fall            object
year            object
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

`convert_dtypes()` es un m√©tdo disponible a partir de Pandas 1.0. Lo que hace es cambiar el tipo de dato de las columnnas por el que Pandas considere m√°s apropiado

In [ ]:
df_meteorites.convert_dtypes().dtypes

name            string
id               Int64
nametype        string
recclass        string
mass (g)       float64
fall            string
year            string
reclat         float64
reclong        float64
GeoLocation     string
dtype: object

### Clase 10. Estructuras de DataFrames en detalle

`nunique()` permite conocer la variedad de los datos, es decir, cu√°ntos valores √∫nicos tiene cada columna

In [ ]:
df_meteorites.nunique()

name           45716
id             45716
nametype           2
recclass         466
mass (g)       12576
fall               2
year             266
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

Gracias a `nunique()` en la celda anterior se descubri√≥ que en las columnas *nametype* y *fall* s√≥lo contienen 2 valores √∫nicos. Al analizar en detalle el contenido de estas columnas en la celda de abajo se puede ver que estas s√≥lo almacenan un string que define una categor√≠a. A este tipo de variables se les conoce como **variables categoricas**

In [ ]:
df_meteorites[['fall', 'nametype']]

        fall nametype
0       Fell    Valid
1       Fell    Valid
2       Fell    Valid
3       Fell    Valid
4       Fell    Valid
...      ...      ...
45711  Found    Valid
45712  Found    Valid
45713  Found    Valid
45714  Found    Valid
45715  Found    Valid

[45716 rows x 2 columns]

Ahora que ya se sabe que variables categoricas hay en el DataFrame, hay que asignarle a dichas variables el tipo de dato `category`. Esto se hace usando el m√©todo `astype(()`

In [ ]:
df_meteorites[['fall', 'nametype']] = df_meteorites[['fall', 'nametype']].astype('category')

df_meteorites.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

Tambi√©n se puede usar `unique()` para conocer cu√°les son las variables que componen una categor√≠a

In [ ]:
df_meteorites['fall'].unique()

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

Para saber la frecuencia de cada una de las variables de una categor√≠a se usa `value_counts()`

In [ ]:
df_meteorites['fall'].value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

#### Variables Dummies

Una variable dummy sirve para **representar la presencia o la ausencia de un valor en algo**, si est√° presente toma el valor 1 y sino est√° presente toma el valor 0. Esto se puede aplicar para cada categoria.

Algunas de sus ventajas son:

- Son una forma √∫til de trabajar con variables categoricas debido a que se pasa de una variable de tipo texto a una de tipo n√∫merico lo cu√°l es muy √∫til a la hora de realizar en an√°lisis de datos.

- Podemos aplicar el mismo modelo para cada categoria ya que todas siguen la misma logica

In [ ]:
pd.get_dummies(df_meteorites['fall'])

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

#### Crear nuevas columnas en un DataFrame

In [ ]:
df_meteorites['ones'] = 1
df_meteorites

             name     id nametype  ... reclong             GeoLocation ones
0          Aachen      1    Valid  ...     6.1       (50.775, 6.08333)    1
1          Aarhus      2    Valid  ...    10.2    (56.18333, 10.23333)    1
2            Abee      6    Valid  ...  -113.0      (54.21667, -113.0)    1
3        Acapulco     10    Valid  ...   -99.9       (16.88333, -99.9)    1
4         Achiras    370    Valid  ...   -65.0     (-33.16667, -64.95)    1
...           ...    ...      ...  ...     ...                     ...  ...
45711  Zillah 002  31356    Valid  ...    17.0       (29.037, 17.0185)    1
45712      Zinder  30409    Valid  ...     9.0     (13.78333, 8.96667)    1
45713        Zlin  30410    Valid  ...    17.7       (49.25, 17.66667)    1
45714   Zubkovsky  31357    Valid  ...    41.5     (49.78917, 41.5046)    1
45715  Zulu Queen  30414    Valid  ...  -115.7  (33.98333, -115.68333)    1

[45716 rows x 11 columns]

In [ ]:
df_meteorites[['fell', 'found']] = pd.get_dummies(df_meteorites['fall'])
df_meteorites

             name     id nametype  ... ones  fell found
0          Aachen      1    Valid  ...    1     1     0
1          Aarhus      2    Valid  ...    1     1     0
2            Abee      6    Valid  ...    1     1     0
3        Acapulco     10    Valid  ...    1     1     0
4         Achiras    370    Valid  ...    1     1     0
...           ...    ...      ...  ...  ...   ...   ...
45711  Zillah 002  31356    Valid  ...    1     0     1
45712      Zinder  30409    Valid  ...    1     0     1
45713        Zlin  30410    Valid  ...    1     0     1
45714   Zubkovsky  31357    Valid  ...    1     0     1
45715  Zulu Queen  30414    Valid  ...    1     0     1

[45716 rows x 13 columns]

#### Variables tipo tiempo

Para convertir variables de tipo texto en variables de tipo tiempo se usa el m√©todo `to_datetime()` de Pandas.

El par√°metro `errors='coerce'` establece que si se encuentra un formato que corresponde al tiempo se genere un variable no n√∫merica.

`format`

In [ ]:
df_meteorites['year']

0        01/01/1880 12:00:00 AM
1        01/01/1951 12:00:00 AM
2        01/01/1952 12:00:00 AM
3        01/01/1976 12:00:00 AM
4        01/01/1902 12:00:00 AM
                  ...
45711    01/01/1990 12:00:00 AM
45712    01/01/1999 12:00:00 AM
45713    01/01/1939 12:00:00 AM
45714    01/01/2003 12:00:00 AM
45715    01/01/1976 12:00:00 AM
Name: year, Length: 45716, dtype: object

In [ ]:
df_meteorites['year'] = pd.to_datetime(
    df_meteorites['year'],
    errors='coerce',
    format='%m/%d/%Y %H:%M:%S %p'
)

df_meteorites

             name     id nametype  ... ones  fell found
0          Aachen      1    Valid  ...    1     1     0
1          Aarhus      2    Valid  ...    1     1     0
2            Abee      6    Valid  ...    1     1     0
3        Acapulco     10    Valid  ...    1     1     0
4         Achiras    370    Valid  ...    1     1     0
...           ...    ...      ...  ...  ...   ...   ...
45711  Zillah 002  31356    Valid  ...    1     0     1
45712      Zinder  30409    Valid  ...    1     0     1
45713        Zlin  30410    Valid  ...    1     0     1
45714   Zubkovsky  31357    Valid  ...    1     0     1
45715  Zulu Queen  30414    Valid  ...    1     0     1

[45716 rows x 13 columns]

In [ ]:
df_meteorites.dtypes

name                   object
id                      int64
nametype             category
recclass               object
mass (g)              float64
fall                 category
year           datetime64[ns]
reclat                float64
reclong               float64
GeoLocation            object
ones                    int64
fell                    uint8
found                   uint8
dtype: object

#### Renombrar columnas

Esto se hace con el m√©todo `rename()`.

- `columns` hace referencia a que se quiere renombrar una columna. Este par√°metro recibe un diccionario donde la llave es el nombre de la columna a renombrar y el valor es el nuevo nombre que va a recibir dicha columna.

- `inplace=True` indica que el cambio se aplique al DataSet original

In [ ]:
df_meteorites.rename(columns={'mass (g)': 'mass'}, inplace=True)

df_meteorites

             name     id nametype  ... ones  fell found
0          Aachen      1    Valid  ...    1     1     0
1          Aarhus      2    Valid  ...    1     1     0
2            Abee      6    Valid  ...    1     1     0
3        Acapulco     10    Valid  ...    1     1     0
4         Achiras    370    Valid  ...    1     1     0
...           ...    ...      ...  ...  ...   ...   ...
45711  Zillah 002  31356    Valid  ...    1     0     1
45712      Zinder  30409    Valid  ...    1     0     1
45713        Zlin  30410    Valid  ...    1     0     1
45714   Zubkovsky  31357    Valid  ...    1     0     1
45715  Zulu Queen  30414    Valid  ...    1     0     1

[45716 rows x 13 columns]

Una forma m√°s pr√°ctica de obtener los nombres de las columnas del DataFrame es usar `list()` o el atributo `columns` del DataFrame:

In [ ]:
list(df_meteorites)

['name',
 'id',
 'nametype',
 'recclass',
 'mass',
 'fall',
 'year',
 'reclat',
 'reclong',
 'GeoLocation',
 'ones',
 'fell',
 'found']

In [ ]:
df_meteorites.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass', 'fall', 'year', 'reclat',
       'reclong', 'GeoLocation', 'ones', 'fell', 'found'],
      dtype='object')

Tambi√©n es posible parsear las fechas al momento de leer el csv:

```
df = pd.read_csv(‚Äòfilename.csv‚Äô, parse_dates=[‚Äòfile_date‚Äô])
```

Tambi√©n es posible crear una funci√≥n por si se tienen datos nulos o una zona horaria diferente:

```
df = pd.read_csv(‚Äòfilename.csv‚Äô,
	parse_dates=[‚Äòcolumn_date‚Äô],
	date_parser=lambda x: pd.to_datetime(x, utc=True))
```

[Documentaci√≥n](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#io-csv-mixed-timezones)